In [ ]:
"""""
UPDATE IOT_DATA.THRESHOLD_ALERT
SET INPUT_DT = NULL, INPUT_PERSON = NULL, INPUT_COMMENT = NULL
WHERE INPUT_PERSON = 'Murodil';

"""""

In [ ]:
"""
CREATE TABLE IOT_Data.threshold_alert (
    CATEGORY VARCHAR(20) NOT NULL,
    EQP VARCHAR(20) NOT NULL,
    TS_DT TIMESTAMP NOT NULL,
    DATA_COLUMN VARCHAR(20) NOT NULL,
    STATE DECIMAL(1) NOT NULL,
    DATA_VALUE DECIMAL(15, 6) NOT NULL,
    THRESHOLD_TYPE DECIMAL(1),
    THRESHOLD_VALUE DECIMAL(15, 6),
    INPUT_DT TIMESTAMP,
    INPUT_PERSON VARCHAR(20),
    INPUT_COMMENT VARCHAR(1000),
    PRIMARY KEY (CATEGORY, EQP, TS_DT, DATA_COLUMN)
)
"""

In [ ]:
"""""  
MERGE INTO Tabel_Name AS target
USING (SELECT ? AS LOCATION, ? AS TS_DT, ? AS VALUE_1_0, ? AS VALUE_3_0, ? AS VALUE_5_0, ? AS VALUE_10_0, ? AS VALUE_15_0, ? AS VALUE_20_0, ? AS VALUE_25_0, ? AS VALUE_50_0 FROM SYSIBM.SYSDUMMY1) AS source
ON target.LOCATION = source.LOCATION
WHEN MATCHED THEN
    UPDATE SET target.TS_DT = source.TS_DT, 
                target.VALUE_1_0 = source.VALUE_1_0, 
                target.VALUE_3_0 = source.VALUE_3_0, 
                target.VALUE_5_0 = source.VALUE_5_0, 
                target.VALUE_10_0 = source.VALUE_10_0, 
                target.VALUE_15_0 = source.VALUE_15_0, 
                target.VALUE_20_0 = source.VALUE_20_0, 
                target.VALUE_25_0 = source.VALUE_25_0, 
                target.VALUE_50_0 = source.VALUE_50_0
WHEN NOT MATCHED THEN
    INSERT (LOCATION, TS_DT, VALUE_1_0, VALUE_3_0, VALUE_5_0, VALUE_10_0, VALUE_15_0, VALUE_20_0, VALUE_25_0, VALUE_50_0)
    VALUES (source.LOCATION, source.TS_DT, source.VALUE_1_0, source.VALUE_3_0, source.VALUE_5_0, source.VALUE_10_0, source.VALUE_15_0, source.VALUE_20_0, source.VALUE_25_0, source.VALUE_50_0);
"""""

In [ ]:
"""
CASE 
WHEN LOCATION = 'RP01' THEN 'RP01_MSAPシード剥離' 
WHEN LOCATION = 'RP02' THEN 'RP02_CZ' 
WHEN LOCATION = 'RP03' THEN 'RP03_SAPシード剥離'  
WHEN LOCATION = 'RP04' THEN 'RP04_アルカリ酸洗浄'  
WHEN LOCATION = 'RP05' THEN 'RP05_現像'  
WHEN LOCATION = 'RP06' THEN 'RP06_無電解銅めっき'  
WHEN LOCATION = 'RP07' THEN 'RP07_ビア底洗浄'  
WHEN LOCATION = 'RP08' THEN 'RP08_ビルドPTNめっき#1' 
WHEN LOCATION = 'RP09' THEN 'RP09_ビルドPTNめっき#2'  
WHEN LOCATION = 'RP10' THEN 'RP10_コアPTNめっき#1'  
WHEN LOCATION = 'RP11' THEN 'RP11_コアPTNめっき#2'    
WHEN LOCATION = 'RP12' THEN 'RP12_水平無電解'     
WHEN LOCATION = 'RP13' THEN 'RP13_水平デスミア' 
END

"""

In [ ]:
"""
SELECT 
    name,
    salary,
    CASE 
        WHEN salary >= 10000 THEN 'High Salary'
        WHEN salary >= 5000 AND salary < 10000 THEN 'Medium Salary'
        ELSE 'Low Salary'
    END AS salary_category
FROM employees;

"""

In [ ]:
"""
SELECT * FROM products
WHERE id IN (1, 2, 3);
"""

In [ ]:
"""
SELECT * FROM orders
WHERE id IN (SELECT id FROM customers WHERE country = 'USA');
"""

In [ ]:
"""
DECLARE @productList NVARCHAR(MAX);
SET @productList = '1, 2, 3';

SELECT * FROM products
WHERE category_id IN (SELECT value FROM STRING_SPLIT(@productList, ','));
"""

In [ ]:
"""
SELECT * FROM orders
WHERE (customer_id, product_id) IN
      (SELECT customer_id, product_id FROM order_details WHERE quantity > 10);
"""

In [ ]:
"""
SELECT *
FROM products p
JOIN categories c ON p.category_id = c.category_id
WHERE c.category_name IN ('Electronics', 'Clothing');
"""

In [ ]:
"""
SELECT * FROM employees
WHERE department_id = 5
AND employee_id IN (SELECT manager_id FROM departments WHERE department_name = 'Sales');
"""

In [ ]:
"""
SELECT column1, column2, SUM(column3) AS total_sales
FROM sales_data
WHERE date BETWEEN '2024-01-01' AND '2024-03-31'
GROUP BY column1, column2
HAVING total_sales > 10000
ORDER BY total_sales DESC;

"""

In [ ]:
"""""
SELECT *
FROM CONDUCTIVITY
WHERE DATE_TIME >= (TIMESTAMP '2024-02-01' - INTERVAL '10' MINUTE);

"""

In [ ]:
"SELECT column1, column2 FROM Table_Name WHERE condition;"

In [ ]:
"INSERT INTO Table_Name (column1, column2) VALUES (value1, value2);"

In [ ]:
"UPDATE Table_Name SET column1 = value1, column2 = value2 WHERE condition;"

In [ ]:
"DELETE FROM Table_Name WHERE condition;"

In [ ]:
"ALTER TABLE Table_Name ADD column_name datatype;"

In [ ]:
"ALTER TABLE table_name MODIFY column_name datatype;"

In [ ]:
"ALTER TABLE table_name DROP COLUMN column_name;"

In [ ]:
"DROP TABLE Table_Name;"

In [ ]:
"CREATE INDEX index_name ON table_name (column1, column2, ...);"

In [ ]:
"SELECT * FROM table1 INNER JOIN table2 ON table1.column = table2.column;"

In [ ]:
sql = f"UPDATE IOT_DATA.THRESHOLD_ALERT SET INPUT_DT='{input_dt}', INPUT_PERSON='{INPUT_PERSON}', INPUT_COMMENT='{INPUT_COMMENT}' WHERE CATEGORY='{CATEGORY}' AND EQP='{EQP}' AND TS_DT='{ts_dt}' AND DATA_COLUMN='{DATA_COLUMN}'"

In [ ]:
"TO_CHAR(DATE_TIME, 'YYYY/MM/DD HH24') || ':' || LEFT(TO_CHAR(DATE_TIME, 'MI'),1) || '0'"

In [ ]:
"TO_CHAR(DATE_TIME, 'YYYY/MM/DD HH24') || ':' || LEFT(TO_CHAR(DATE_TIME, 'MI'),1) || '0'"

In [ ]:
"EQP_ID || '_' || UNIT_NUM"

In [ ]:
"TO_CHAR(TS_DT, 'YYYY/MM/DD HH24') || ':' || LEFT(TO_CHAR(TS_DT, 'MI'),1) || '0'"

In [ ]:
"項目A||'年'"

In [ ]:
"項目A||項目B||項目C"

In [ ]:
"TO_CHAR(TS_DT, 'YYYY/MM/DD HH24') || ':' || LEFT(TO_CHAR(TS_DT, 'MI'),1) || '0'"

In [ ]:
"WHERE (INPUT_PERSON IS NULL OR INPUT_PERSON = '')"